#+Title: Org-mode all the thingz!
#+Author: Nick Anderson
#+Email: nick@cmdln.org
#+PROPERTY: header-args:cfengine3+ :eval never-export
# Export cfengine code block execution output by default
#+PROPERTY: header-args:cfengine3+ :exports both
#+PROPERTY: header-args:sh+ :eval never-export
#+PROPERTY: header-args:shell+ :eval never-export
#+OPTIONS: reveal_center:t reveal_progress:t reveal_history:nil reveal_control:t
#+OPTIONS: reveal_rolling_links:t reveal_keyboard:t reveal_overview:t num:nil
#+OPTIONS: reveal_width:1200 reveal_height:800 tags:nil
# The TOC is a bit much for a slide show IMHO, but maybe you want it when exporting to html
#+OPTIONS: toc:nil
#+REVEAL_MARGIN: 0.1
#+REVEAL_MIN_SCALE: 0.5
#+REVEAL_MAX_SCALE: 2.5
# Available Transitions: default|cube|page|concave|zoom|linear|fade|none.
#+REVEAL_TRANS: fade
#+REVEAL_THEME: night
# This flattens up to x levels deep
#+REVEAL_HLEVEL: 1
#+REVEAL_HEAD_PREAMBLE: <meta name=description" content=Org-mode all the thingz!">
#+REVEAL_POSTAMBLE: <p> Created by Nick Anderson. </p>
#+REVEAL_PLUGINS: (notes)
#+OPTIONS: reveal_single_file:nil

#+DOWNLOADED: https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Org-mode-unicorn.svg/800px-Org-mode-unicorn.svg.png @ 2019-07-19 16:43:44
*** Stored one file per day

#+BEGIN_SRC sh :exports both
  ls ~/org/journal | grep -P "2019-0[345]" | head -n 5
#+END_SRC

#+RESULTS:
| 2019-03-03 |
| 2019-03-06 |
| 2019-03-11 |
| 2019-03-12 |
| 2019-03-14 |
* Tables/Spreadsheets

#+CAPTION: @>$2=vmin(@2..@-1)::@>$3=vmax(@2..@-1)::@>$4=vmean(@2..@-1)::@>$5=vsum(@2..@-1)
|----------+-----------+------------+------+-----|
| Item     | Low Value | High Value | Mean | Sum |
|----------+-----------+------------+------+-----|
| Hammer   |         1 |        100 |   10 |  11 |
| More     |         3 |        200 |   11 |   8 |
| Axe      |        20 |         25 |   30 |  13 |
|----------+-----------+------------+------+-----|
| *Total:* |         1 |        200 |   17 |  32 |
|----------+-----------+------------+------+-----|
#+TBLFM: @>$2=vmin(@2..@-1)::@>$3=vmax(@2..@-1)::@>$4=vmean(@2..@-1)::@>$5=vsum(@2..@-1)

- Each formula is separated with =::=
- =@= indicates the ROW (=@>= means *last row*)
- =$= indicates the COLUMN

** Referencing cells by name

#+CAPTION: $l=vmin(@2..@-1)::$h=vmax(@2..@-1)::$m=vmean(@2..@-1)::$s=vsum(@2..@-1)
|-----------+-----------+------------+------+-----|
| Item      | Low Value | High Value | Mean | Sum |
|-----------+-----------+------------+------+-----|
| Hammer    |        10 |         20 |   10 |  10 |
| Axe       |        20 |         25 |   30 |  13 |
|-----------+-----------+------------+------+-----|
| *^Total:* |        10 |         25 |   20 |  23 |
| ^         |         l |          h |    m |   s |
|-----------+-----------+------------+------+-----|
#+TBLFM: $l=vmin(@2..@-1)::$h=vmax(@2..@-1)::$m=vmean(@2..@-1)::$s=vsum(@2..@-1)

- =^= indicates field values on this line define names for the field ABOVE this row

